########################
# qq空间相关的常量，主要用于改进数据集质量和安全性
########################

# 敏感个人信息处理
privacy_information = []

# 你的用户名
default_username = ""

# 对消息中的url进行无害化处理
urls = {
}

# 消息中应该去除的内容
qq_msg_ignore_list = ["[图片]", "[表情]", "[语音]", "[文件]", "[视频]", "[QQ红包]", "[QQ红包]", "[哦]",
               "[闪照]请使用新版手机QQ查看闪照。", "[闪照]", "[流泪]请使用最新版手机QQ体验新功能", "[流泪]", "[/可怜]",
               "[自动回复]", r"\u200b"]

emoji_mapping = {
    "[em]e400827[/em]": "😅",
    "[em]e248[/em]": "🤪", # 滑稽，但没有这个表情
    "[em]e100[/em]": "🙂",
    "[em]e400933[/em]": "🙏",
    "[em]e10277[/em]": "🤣",
    "[em]e402211[/em]": "🤤",
    "[em]e400351[/em]": "👀",
    "[em]e400408[/em]": "👍",
    "[em]e400640[/em]": "💦",
    "[em]e252[/em]": "😂",
    "[em]e400833[/em]": "😋",
    "[em]e113[/em]": "😁",
    "[em]e109[/em]": "🥺",
    "[em]e243[/em]": "😭",
    "[em]e249[/em]": "😳",
    "[em]e10317[/em]": "🤪",
    "[em]e282[/em]": "🤔",
    "[em]e111[/em]": "🤬",
    "[em]e402363[/em]": "🤭",
    "[em]e120[/em]": "😁",
    "[em]e139[/em]": "👋",
    "[em]e401685[/em]": "⚡",
    "[em]e121011[/em]": "💢",
    "[em]e257417[/em]": "☁️",
    "[em]e247[/em]": "😵‍💫",
    "[em]e112[/em]": "😝",
    "[em]e144[/em]": "😄"
}